Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
	// Egyszerre csak egy karaktert várunk.
	HAL_UART_Receive_IT(&huart6, uart6Data, 1);
	while(1)
	{
		i = 0;
		while(i<MESSAGE_LENGTH)
		{
			// Az elsõ karakterre folyamatosan várunk, viszont ha nem érkezik rövid idõn belül új karakter, akkor feltételezzük, hogy hiba történt \
			és eldobjuk az eddigi csomagot, illetve a következõ sorvége karakterig eldobjuk a karaktereket (vagy kiürítjük a MessageQ-t)
			if(i==0)
				event = osMessageGet(uart6Receive_xMessage, portMAX_DELAY);
			else
				event = osMessageGet(uart6Receive_xMessage, 10);

			if(event.status == osEventMessage)
			{
				data[i] = event.value.p;

				// Ha a sorvége karakter az üzenet közepén érkezett, akkor hiba történt, ezért eldobjuk a csomagot.
				if(data[i] == '\n' && i!=(MESSAGE_LENGTH-1))
					i=0;
				else
					i++;
			}
			else
				i=0;
		}
		// Beérkezett adat feldarabolása
		memcpy(entity, data, ENTITY_LENGTH);
		entity[ENTITY_LENGTH] = '\0';
		memcpy(value, &data[ENTITY_LENGTH+1], VALUE_LENGTH);

		// A GUI csatlakozott
		if(!strcmp(entity, connectString))
		{
			RemoteControllerConnected();
		}
		// LED0 állítása
		else if(!strcmp(entity, led0String))
		{
			if(value[0] == 0xAA && value[1] == 0xAA && value[2] == 0xAA && value[3] == 0xAA)
				ChangeLed0State(GPIO_PIN_SET);
			else
				ChangeLed0State(GPIO_PIN_RESET);
		}
		// LED1 állítása
		else if(!strcmp(entity, led1String))
		{
			if(value[0] == 0xAA && value[1] == 0xAA && value[2] == 0xAA && value[3] == 0xAA)
				ChangeLed1State(GPIO_PIN_SET);
			else
				ChangeLed1State(GPIO_PIN_RESET);
		}
		else
		{
			// Valószínûleg bithiba történt, esetleg nem érkezett meg valamelyik byte, ekkor a további hibák\
			akkumulálódását elkerülvén megkeressük a következõ sorvége karaktert, vagy kiürítjük a MessageQ-t
			do
			{
				event = osMessageGet(uart6Receive_xMessage,0);
			} while(event.status == osEventMessage && event.value.p !='\n');
		}
	}
	// ToDo: Valamiért kifagy a parancsfogadás! (Talán már javítja önmagát.)
}

void StartUART6SendTask(void const * argument)
{
	osEvent event;
	uint8_t character;
	uint16_t size = sizeof(character)/sizeof(uint8_t);

	osMessageQDef(UART6MES, 140, uint8_t);
	uart6Send_xMessage = osMessageCreate(osMessageQ(UART6MES), NULL);

	while(1)
	{
		event = osMessageGet(uart6Send_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			character = (uint32_t)event.value.p;

			// Az üzenetek küldése közben ne legyen megszakítás!
			portENTER_CRITICAL();
			HAL_UART_Transmit(&huart6, &character, size, 100);
			portEXIT_CRITICAL();
		}
	}
}

// FatFS open for append. Source: http://elm-chan.org/fsw/ff/res/app1.c
FRESULT open_append (
    FIL* fp,            /* [OUT] File object to create */
    const uint8_t* path    /* [IN]  File name to be opened */
)
{
    FRESULT fr;

    /* Opens an existing file. If not exist, creates a new file. */
    fr = f_open(fp, (char*)path, FA_WRITE | FA_OPEN_ALWAYS);

    if (fr == FR_OK) {
        /* Seek to end of the file to append data */
    	fr = f_lseek(fp, f_size(fp));
        if (fr != FR_OK)
            f_close(fp);
    }
    return fr;
}

void StartSDCardTask(void const * argument)
{
	// SDCard deinicializálásához szükséges külsõ változó
	extern Disk_drvTypeDef  disk;

	osMessageQDef(SDCARDMES, 255, uint8_t);
	sdCardWrite_xMessage = osMessageCreate(osMessageQ(SDCARDMES), NULL);

	FATFS fileSystem;
	FIL logFile;
	UINT testBytes;
	FRESULT res;

	osEvent event;
	uint8_t cardMounted = 0;

	int i;
	uint8_t message[255];

	while(1)
	{
		i = 0;
		memset(message,0,255);

		// CD láb ellenõrzése
		event = osMessageGet(sdCardWrite_xMessage, portMAX_DELAY);
		if(event.status == osEventMessage)
		{
			message[i] = (uint32_t)event.value.p;

			do
			{
				i++;

				event = osMessageGet(sdCardWrite_xMessage, 0);
				if(event.status == osEventMessage)
					message[i] = (uint32_t)event.value.p;
			} while(event.status == osEventMessage);

			if(HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_15) == GPIO_PIN_RESET)
			{
				if(!cardMounted)
				{
					if(f_mount(&fileSystem, SD_Path, 1) == FR_OK)
					{
						uint8_t path[12] = "logfile.txt";
						path[11] = '\0';

						cardMounted = 1;

						// Ez nem szép dolog, de enélkül a szektorméret elérése után megáll a tudomány
						portENTER_CRITICAL();
						res = open_append(&logFile, path);
						portEXIT_CRITICAL();

						if(res == FR_OK)
						{
							portENTER_CRITICAL();
							res = f_write(&logFile, message, i, &testBytes);
							portEXIT_CRITICAL();
						}
						if(res == FR_OK)
						{
							portENTER_CRITICAL();
							res = f_sync(&logFile);
							portEXIT_CRITICAL();
						}
						if(res == FR_OK)
						{
							//portENTER_CRITICAL();
							res = f_close(&logFile);
							//portEXIT_CRITICAL();
						}

						// Hiba esetén leválasztjuk, majd újra felcsatoljuk a kártyát
						if(res != FR_OK)
						{
							f_mount(NULL, SD_Path, 1);
							// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
							disk.is_initialized[0] = 0;
							cardMounted = 0;
						}
						else
							HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
					}
				}
				else
				{
					uint8_t path[12] = "logfile.txt";
					path[11] = '\0';

					// Ez nem szép dolog, de enélkül a szektorméret elérése után megáll a tudomány
					portENTER_CRITICAL();
					res = open_append(&logFile, path);
					portEXIT_CRITICAL();

					if(res == FR_OK)
					{
						portENTER_CRITICAL();
						res = f_write(&logFile, message, i, &testBytes);
						portEXIT_CRITICAL();
					}
					if(res == FR_OK)
					{
						portENTER_CRITICAL();
						res = f_sync(&logFile);
						portEXIT_CRITICAL();
					}
					if(res == FR_OK)
					{
						//portENTER_CRITICAL();
						res = f_close(&logFile);
						//portEXIT_CRITICAL();
					}

					// Hiba esetén leválasztjuk, majd újra felcsatoljuk a kártyát
					if(res != FR_OK)
					{
						f_mount(NULL, SD_Path, 1);
						// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
						disk.is_initialized[0] = 0;
						cardMounted = 0;
					}
					else
						HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
				}
			}
			else
			{
				if(cardMounted)
				{
					f_mount(NULL, SD_Path, 1);
					// Ez nem szép dolog, de enélkül nem inicializálja fel többször az SDCardot
					disk.is_initialized[0] = 0;
				}

				cardMounted = 0;
			}
		}
	}
}
#endif // defined(MEAS_W_LOAD)
/* USER CODE END 4 */

